package services;

public class Menu {

    /*
     *
     * 登录界面菜单
     *
     * */
    public static void login() {
        System.out.printf("===========================\n" +
                "学生选课管理系统\n" +
                "===========================\n" +
                "1. 登录\n" +
                "2. 注册\n" +
                "3. 修改密码\n" +
                "4. 退出\n" +
                "请选择操作（输入 1-3）：");
    }


    public static void student() {
        System.out.println("===== 学生菜单 =====\n" +
                "1. 查看可选课程\n" +
                "2. 选择课程\n" +
                "3. 退选课程\n" +
                "4. 查看个人信息\n" +
                "5. 修改手机号\n" +
                "6. 退出\n" +
                "请选择操作（输入 1-6）：");
    }

    public static void admin() {
        System.out.print("===== 管理员菜单 =====\n" +
                "1. 查询所有学生\n" +
                "2. 修改学生手机号\n" +
                "3. 查询所有课程\n" +
                "4. 修改课程学分\n" +
                "5. 查询某课程的学生名单\n" +
                "6. 查询某学生的选课情况\n" +
                "7. 增设课程\n" +
                "8. 删除课程\n" +
                "9. 退出\n" +
                "请选择操作（输入 1-8）：");
    }

}
